#+TITLE: May 10, 2017 - May 26, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                        | WAITING | DONE | CANCELED |
|------+------+----------------------------------------------------+---------+------+----------|
|      |      | READING.1495095647. Study of Linux kernel bug life |         |      |          |
|      |      | WRITING.1495095749. Make flow diagram for audio fi |         |      |          |
|      |      | WRITING.1495095780. Defining and including paramet |         |      |          |
|      |      | WRITING.1495096110. Dry run and space-time complex |         |      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Amey   |      12.0 |      0 |    0 |      12.0 |   2017-06-01 | ---------- |
| Mpduty |      16.0 |      0 |    0 |      16.0 |   2017-06-05 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  70 ++------+-------+--------+-------+-------+-------+--------+-------+--++   
:     |   ###########################################################       |   
:     |   ....                                               ACTUAL ####### |   
:  60 ++      ....                                            IDEAL .......++   
:     |           ....                                                      |   
:  50 ++              .....                                                ++   
:     |                    ....                                             |   
:     |                        ....                                         |   
:  40 ++                           ....                                    ++   
:     |                                ....                                 |   
:  30 ++                                   ....                            ++   
:     |                                        ....                         |   
:     |                                            ....                     |   
:  20 ++                                               .....               ++   
:     |                                                     ....            |   
:  10 ++                                                        ....       ++   
:     |                                                             ....    |   
:     |                                                                 ....|   
:   0 ++------+-------+--------+-------+-------+-------+--------+-------+--+.   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2017-05-10 |   66.0 |    62 |                 |
|   2 | 2017-05-11 |   66.0 |    58 |                 |
|   3 | 2017-05-12 |   66.0 |    54 |                 |
|   4 | 2017-05-13 |   66.0 |    50 |                 |
|   5 | 2017-05-14 |   66.0 |    47 |                 |
|   6 | 2017-05-15 |   66.0 |    43 |                 |
|   7 | 2017-05-16 |   66.0 |    39 |                 |
|   8 | 2017-05-17 |   66.0 |    35 |                 |
|   9 | 2017-05-18 |   66.0 |    31 |                 |
|  10 | 2017-05-19 |   66.0 |    27 |                 |
|  11 | 2017-05-20 |   66.0 |    23 |                 |
|  12 | 2017-05-21 |   66.0 |    19 |                 |
|  13 | 2017-05-22 |   66.0 |    16 |                 |
|  14 | 2017-05-23 |   66.0 |    12 |                 |
|  15 | 2017-05-24 |   66.0 |     8 |                 |
|  16 | 2017-05-25 |        |     4 |                 |
|  17 | 2017-05-26 |        |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                  | TASKID             | OWNER  | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|-------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| TASKS                                                 |                    |        | B        |             |      66.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| READING                                               |                    |        | B        |             |      32.0 |        |
| Study of Linux kernel bug life-cycle                  | READING.1495095647 | mpduty | B        | IN_PROGRESS |      16.0 |        |
| Study of kernel regression testing tools              | READING.1495095693 | mpduty | B        |             |      16.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| WRITING                                               |                    |        | B        |             |      24.0 |        |
| Make flow diagram for audio fingerprinting            | WRITING.1495095749 | amey   | B        | IN_PROGRESS |       4.0 |        |
| Defining and including parameters                     | WRITING.1495095780 | amey   | B        | IN_PROGRESS |       4.0 |        |
| Review of flow diagram, parameters and proposal       | WRITING.1495095805 | amey   | B        |             |       4.0 |        |
| Flow diagram from phases/modules                      | WRITING.1495095922 | amey   | B        |             |       4.0 |        |
| Add parameters                                        | WRITING.1495096024 | amey   | B        |             |       4.0 |        |
| Dry run and space-time complexity                     | WRITING.1495096110 | amey   | B        | IN_PROGRESS |       4.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| TESTING                                               |                    |        | B        |             |       4.0 |        |
| Dry runs and basic time and space complexity analysis | TESTING.1495095842 | amey   | B        |             |       4.0 |        |
|-------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| EVENTS                                                |                    |        | B        |             |       6.0 |        |
| amey daily community bonding                          | EVENTS.1495633044  | amey   | B        |             |       6.0 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2017-05-10 Wed>
  :wpd-mpduty: 2
  :wpd-amey:   2
  :END:
** READING
*** IN_PROGRESS Study of Linux kernel bug life-cycle
    :PROPERTIES:
    :ESTIMATED: 16.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: READING.1495095647
    :TASKID: READING.1495095647
    :END:
    :LOGBOOK:
    CLOCK: [2017-05-20 Sat 09:15]--[2017-05-20 Sat 10:05] =>  0:50
    CLOCK: [2017-05-19 Fri 08:10]--[2017-05-19 Fri 10:20] =>  2:10
    CLOCK: [2017-05-17 Wed 07:45]--[2017-05-17 Wed 10:15] =>  2:30
    :END:
    Study of bug reports, bug fixes and bug closes related to the
    Linux kernel from two places:

    https://fedoraproject.org/wiki/KernelBugTriage
    https://bugzilla.kernel.org/

    Exploring
    https://bugzilla.redhat.com/query.cgi? and
    https://bugzill.kernel.org/query.cgi

    Exploring tools for website scraping and finally decided with
    scrapy.
*** Study of kernel regression testing tools
    :PROPERTIES:
    :ESTIMATED: 16.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: READING.1495095693
    :TASKID: READING.1495095693
    :END:
    Use and study of some kernel regression testing tools.
** WRITING
*** IN_PROGRESS Make flow diagram for audio fingerprinting
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095749
    :TASKID: WRITING.1495095749
    :END:
    :LOGBOOK:
    CLOCK: [2017-05-20 Sat 17:44]--[2017-05-20 Sat 18:45] =>  1:01
    CLOCK: [2017-05-20 Sat 15:52]--[2017-05-20 Sat 15:57] =>  0:05
    CLOCK: [2017-05-20 Sat 14:09]--[2017-05-20 Mon 14:41] =>  0:32
    CLOCK: [2017-05-19 Fri 19:51]--[2017-05-19 Fri 20:49] =>  0:58
    CLOCK: [2017-05-19 Fri 17:02]--[2017-05-19 Fri 18:35] =>  1:33

    CLOCK: [2017-05-18 Thu 22:23]--[2017-05-18 Wed 23:45] =>  1:22
    CLOCK: [2017-05-18 Thu 16:29]--[2017-05-18 Wed 17:15] =>  0:46
    CLOCK: [2017-05-18 Thu 13:52]--[2017-05-18 Wed 15:54] =>  2:02
    CLOCK: [2017-05-17 Wed 21:00]--[2017-05-17 Wed 22:00] =>  1:00
    :END:
*** IN_PROGRESS Defining and including parameters
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095780
    :TASKID: WRITING.1495095780
    :END:
    :LOGBOOK:
    CLOCK: [2017-05-22 Mon 09:25]--[2017-05-22 Mon 10:27] =>  1:02
    CLOCK: [2017-05-22 Mon 13:38]--[2017-05-22 Mon 14:13] =>  0:35
    CLOCK: [2017-05-22 Mon 14:27]--[2017-05-22 Mon 15:37] =>  1:10
    :END:
*** Review of flow diagram, parameters and proposal
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095805
    :TASKID: WRITING.1495095805
    :END:
*** Flow diagram from phases/modules
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495095922
    :TASKID: WRITING.1495095922
    :END:
    Flow diagram: A diagram representing processing of data from
    various phases/modules like pre-processing, Fast fourier
    transform, feature extraction etc.
*** Add parameters
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495096024
    :TASKID: WRITING.1495096024
    :END:
    Parameters on which phases are going to depend. Like range of
    operating frequency, sampling rate etc.
*** IN_PROGRESS Dry run and space-time complexity
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: WRITING.1495096110
    :TASKID: WRITING.1495096110
    :END:
    :LOGBOOK:
    CLOCK: [2017-05-22 Mon 18:54]--[2017-05-22 Mon 20:06] =>  1:12
    :END:
** TESTING
*** Dry runs and basic time and space complexity analysis
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: amey
    :ID: TESTING.1495095842
    :TASKID: TESTING.1495095842
    :END:
** EVENTS
*** amey daily community bonding
    :PROPERTIES:
    :ESTIMATED: 6.0
    :ACTUAL:
    :OWNER: amey
    :ID: EVENTS.1495633044
    :TASKID: EVENTS.1495633044
    :END:
